<template>
  <div>Политика конфиденциальности
    1. Владелец сайта (далее Сайт) с уважением относится к правам посетителей Сайта и безоговорочно признаёт важность
    конфиденциальности личной информации. Используя Сайт, вы полностью соглашаетесь с данной Политикой
    конфиденциальности.

    2.Основные положения:


    Сайт не передаёт вашу персональную информацию третьим лицам;
    Оставляя какую-либо информацию о себе (ФИО, телефон, почтовый адрес, адрес электронной почты, банковские реквизиты,
    реквизиты компании) вы даете согласие на обработку ваших данных.
    Вы самостоятельно определяете объём раскрываемой персональной информации;
    Персональная информация используется для исполнения конкретного договора с конкретным человеком/органицацией;


    3. Собираемая информация:

    Сайт собирает вашу персональную информацию, которую вы сознательно согласились раскрыть нам, заполнив одну из форм
    Сайта.
    Сайт автоматически собирает техническую информацию, получаемую во время посещения вами Сайта:
    IP-адрес компьютера или прокси-сервера;
    тип браузера и операционной системы;
    информация о страницах Сайта, которые вы посещаете, дата и время этих посещений;
    информация о файлах, которые Вы загружаете.
    Собираемая информация в обезличенном виде используется для улучшений и развития Сайта.
    Техническую обезличенную информацию о Сайте собирают установленные счётчики статистики.


    4. Использование cookies

    <NuxtLink :to="'https://ru.wikipedia.org/wiki/Cookie'">(читать о cookies на википедии)</NuxtLink>

    На Сайте применяется технология идентификации пользователей, основанная на использовании файлов cookies. Cookies –
    это небольшие текстовые файлы, сохраняемые на Вашем компьютере посредством веб-браузера.

    При использовании Пользователем Сайта на компьютер, используемый им для доступа, могут быть записаны файлы cookies,
    которые в дальнейшем будут использованы для автоматической идентификации Пользователя на Сайте, а также для сбора
    статистических данных, в частности о посещаемости Сайта.

    Сайт никогда не сохранят персональные данные или пароли в файлах cookies.

    5. Сайт осуществляет защиту информации, предоставленной пользователями, и использует ее только в соответствии с
    принятой Политикой конфиденциальности. На Сайте используются общепринятые методы безопасности для обеспечения защиты
    информации от потери, искажения и несанкционированного распространения. Безопасность реализуется программными
    средствами сетевой защиты, процедурами проверки доступа, применением криптографических средств защиты информации,
    соблюдением политики конфиденциальности.

    6. Данная Политика конфиденциальности не означает заключения договора между Сайтом и Пользователем, предоставляющим
    персональную информацию. Политика конфиденциальности только проинформирует о подходах Сайта к работе с персональными
    данными. Сайт оставляет за собой право вносить изменения в настоящую Политику конфиденциальности в любое время без
    предварительного уведомления.

    7. По всем вопросам обращайтесь через форму обратной связи на странице контактов.

    Информация предоставлена на основе требований Федерального закона "О персональных данных" от 27.07.2006 № 152-ФЗ.
  </div>
</template>

<script setup lang="ts">

</script>

<style lang="scss">

</style>