<template>
  <div class="boss-container">
    <div class="boss-container--photo">
      <div class="image">
        <img :src='Image' alt="boss">
      </div>
    </div>
    <div class="boss-container--text">
      <div class="slogan">
        <p>
          Желаю, чтобы все!
        </p>
      </div>
      <div class="history">
        <p class="hidden lg:block">
          Компания «РТА (Региональный Транспортный Агент)» занимается осуществлением грузоперевозок с 2017 года. За это
          время мы продемонстрировали свою способность работать с разными видами грузов и транспортных средств, решать
          самые сложные задачи и контролировать процесс транспортировки на каждом из его этапов.
          Мы предлагаем своим клиентам полный комплекс услуг по перевозке грузов и гарантируем надежность доставки
          продукции при минимальных затратах. Компания «РТА» готова предоставить следующие виды услуг:
          Контейнерные перевозки. Перемещение грузов осуществляется в контейнерах разного типа.
          Мультимодальные перевозки. Осуществляются одним грузоперевозчиком, но разными видами транспорта.
          Экспортные и импортные перевозки. Транспортировка грузов из-за рубежа в Россию и обратно.
          Терминальные услуги. Включают в себя обслуживание грузов и транспортных средств в промежуточном и конечном
          пунктах доставки.
        </p>
        <p class="hidden xs:block lg:hidden">
          Компания «РТА» осуществляет грузоперевозки с 2017 года, предлагая полный комплекс услуг по транспортировке
          грузов, включая контейнерные и мультимодальные перевозки, экспорт и импорт, терминальные услуги, аренду
          контейнеров и доставку сборного груза. Обеспечиваем перевозку любых видов грузов с логистической поддержкой и
          диспетчерским контролем
        </p>
        <p class="sm:hidden">
          Компания «РТА» с 2017 года обеспечивает перевозку любых видов грузов с логистической поддержкой и
          диспетчерским контролем
        </p>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import Image from '~/assets/images/boss.jpg'

</script>

<style lang="scss">
.boss-container {
  @apply flex justify-evenly items-center mt-2 px-2 sm:gap-2;

  &--photo {
    @apply flex-1;

    .image {
      @apply w-full;

      & > img {
        @apply mx-auto rounded;
      }
    }

  }

  &--text {
    @apply flex flex-1 flex-col justify-evenly items-start gap-2;
    @apply pl-5;
    @apply text-xs sm:text-sm md:text-base;

    .slogan {
      @apply text-dk;
    }

    .history {

    }

  }
}

</style>