<template>
  <div class="boss-container">
    <div class="boss-container--photo">
      <div class="image">
        <img :src=Image alt="boss">
      </div>
    </div>
    <div class="boss-container--text">
      <div class="slogan">
        <p>
          Желаю, чтобы все!
        </p>
      </div>
      <div class="history">
        <p>
          Компания «РТА (Региональный Транспортный Агент)» занимается осуществлением грузоперевозок с 2017 года. За это
          время мы продемонстрировали свою способность работать с разными видами грузов и транспортных средств, решать
          самые сложные задачи и контролировать процесс транспортировки на каждом из его этапов.
          Мы предлагаем своим клиентам полный комплекс услуг по перевозке грузов и гарантируем надежность доставки
          продукции при минимальных затратах. Компания «РТА» готова предоставить следующие виды услуг:
          Контейнерные перевозки. Перемещение грузов осуществляется в контейнерах разного типа.
          Мультимодальные перевозки. Осуществляются одним грузоперевозчиком, но разными видами транспорта.
          Экспортные и импортные перевозки. Транспортировка грузов из-за рубежа в Россию и обратно.
          Терминальные услуги. Включают в себя обслуживание грузов и транспортных средств в промежуточном и конечном
          пунктах доставки.
          Аренда контейнеров. Идеальный вариант для тех, кто не хочет приобретать контейнер в долгосрочное пользование.
          Доставка сборного груза. Подходит в тех случаях, когда необходимо переместить небольшие партии товаров.
          Компания осуществляет перевозку любых видов грузов – в том числе, негабаритных и крупногабаритных. Успешно
          разрабатывает логистические схемы для перевозки, организует погрузочно-разгрузочные работы, транспортную
          обработку грузов, диспетчерский контроль за выполнением заказа
        </p>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import Image from '~/assets/images/boss.jpg'

</script>

<style lang="scss">
.boss-container {
  @apply flex justify-evenly items-center gap-2;

  &--photo {
    @apply min-w-60;

    .image {
      @apply w-full;

      & > img {
        @apply w-full rounded;
      }
    }

  }

  &--text {
    @apply flex flex-col justify-evenly items-start gap-2;
    @apply pl-5;

    .slogan {
      @apply text-dk;
    }

    .history {

    }

  }
}

</style>