<template>
  <div class="about-container">
    <div class="about-container--top">
      Компания «РТА (Региональный Транспортный Агент)» занимается осуществлением грузоперевозок с 2017 года. За это
      время мы продемонстрировали свою способность работать с разными видами грузов и транспортных средств, решать самые
      сложные задачи и контролировать процесс транспортировки на каждом из его этапов.

      Мы предлагаем своим клиентам полный комплекс услуг по перевозке грузов и гарантируем надежность доставки продукции
      при минимальных затратах. Компания «РТА» готова предоставить следующие виды услуг:

      Контейнерные перевозки. Перемещение грузов осуществляется в контейнерах разного типа.
      Мультимодальные перевозки. Осуществляются одним грузоперевозчиком, но разными видами транспорта.
      Экспортные и импортные перевозки. Транспортировка грузов из-за рубежа в Россию и обратно.
      Терминальные услуги. Включают в себя обслуживание грузов и транспортных средств в промежуточном и конечном пунктах
      доставки.
      Аренда контейнеров. Идеальный вариант для тех, кто не хочет приобретать контейнер в долгосрочное пользование.
      Доставка сборного груза. Подходит в тех случаях, когда необходимо переместить небольшие партии товаров.
      Компания осуществляет перевозку любых видов грузов – в том числе, негабаритных и крупногабаритных. Успешно
      разрабатывает логистические схемы для перевозки, организует погрузочно-разгрузочные работы, транспортную обработку
      грузов, диспетчерский контроль за выполнением заказа.
    </div>
    <div class="about-container--bot">
      <AboutCard
        v-for="feature in aboutData"
        :key="feature.title"
        :src="feature.src"
        :title="feature.title"
        :text="feature.text"
        :order="feature.order" />
    </div>
  </div>
</template>

<script setup lang="ts">
import AboutCard from '~/components/AboutCard.vue'
import ImageA from '~/assets/images/featA.jpg'
import ImageB from '~/assets/images/featB.jpg'
import ImageC from '~/assets/images/featC.jpg'
import ImageD from '~/assets/images/featD.jpg'

const aboutData = ref([
  {
    title: 'БЫСТРАЯ ОБРАТНАЯ СВЯЗЬ',
    text: 'За вами закрепляется менеджер, который будет готов оперативно ответить вам на вопросы, связанные с вашим грузом',
    src: ImageA,
    order: 2,
  },
  {
    title: 'ГИБКИЕ ЦЕНЫ',
    text: 'Наличие ключевых партнеров и собственных контейнеров в России за рубежом позволяет нам давать нашим клиентам выгодные ставки',
    src: ImageB,
    order: 1,
  },
  {
    title: 'НАДЁЖНОСТЬ И ЭКСПЕРТНОСТЬ',
    text: 'Мы уже более 8 лет на рынке и зарекомендовали себя как надежны партнеры знающие своё дело',
    src: ImageC,
    order: 2,
  },
  {
    title: 'ПРИСУТСТВИЕ ПО ВСЕЙ РОССИИ',
    text: 'Наши филиалы находятся в городах: Красноярск, Новосибирск, Хабаровск, Иркутск',
    src: ImageD,
    order: 1,
  },
])
</script>

<style lang="scss">
.about-container {
  @apply grid auto-rows-auto;

  &--top {
    @apply p-5;
  }

  &--bot {
    @apply grid grid-cols-4;
  }
}

</style>